Documents/бит_УстановкаСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаСчетчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
				<xr:Item>AccumulationRegister.бит_ПоказанияСчетчиков</xr:Item>
				<xr:Item>InformationRegister.бит_ПоверкаСчетчиков</xr:Item>
				<xr:Item>InformationRegister.бит_ГрупповыеСчетчики</xr:Item>
				<xr:Item>InformationRegister.бит_СчетчикиНаУслугахОбщий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВведеныРазовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкаСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодборРазныеЗдания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_УстановкаСчетчикаНаДомБезЛС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонечныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияУменьшения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаУменьшения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индивидуальный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомерСчетчикаПоУслуге</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановленныйСчетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ПоверкаСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПоверкаСчетчиков</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнятНаПоверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_ПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ПоказанияСчетчиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследниеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияИнспектора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПодкрутка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_ГрупповыеСчетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГрупповыеСчетчики</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьИндивидуальныйСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрупповойСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПорядковыйНомерСчетчикаПоУслуге</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Групповой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_УстановкаСчетчика/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФунции

Функция ОбновитьКэшДокумента(Объект) Экспорт
	
	мКэшЗначений = Новый Структура;
	мКэшЗначений.Вставить("Разрядность"                  , 0);
	мКэшЗначений.Вставить("ДатаПоверки"                  , Дата("00010101000000"));
	мКэшЗначений.Вставить("МестоУстановкиСчетчика"       , Справочники.бит_Комнаты.ПустаяСсылка());
	мКэшЗначений.Вставить("ИспользоватьСтавкуПоСчетчику" , Ложь);
	мКэшЗначений.Вставить("СчетчикСЗависимымиУслугами"   , Ложь);
	мКэшЗначений.Вставить("ИспользоватьПравилоУменьшения", Ложь);
	мКэшЗначений.Вставить("ТипСчетчика"                  , Перечисления.бит_ТипСчетчика.ПустаяСсылка());
	мКэшЗначений.Вставить("Квартира"                     , Справочники.бит_Квартиры.ПустаяСсылка());
	мКэшЗначений.Вставить("Улица"                        , Справочники.бит_СписокУлиц.ПустаяСсылка());
	мКэшЗначений.Вставить("Приоритет"                    , 0);
	мКэшЗначений.Вставить("СписокЛС"                     , Новый СписокЗначений);
	мКэшЗначений.Вставить("СписокУС"                     , Новый СписокЗначений);
	мКэшЗначений.Вставить("СписокЗданий"                 , Новый СписокЗначений);
	мКэшЗначений.Вставить("ТаблицаУслуг"                 , Новый ТаблицаЗначений);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"   , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Объект" , Объект.Объект);
	Запрос.УстановитьПараметр("Счетчик", Объект.Счетчик);
	
	СписокЛС     = Новый СписокЗначений;
	СписокУС     = Новый СписокЗначений;
	СписокЗданий = Новый СписокЗначений;
	
	Индивидуальный      = Объект.Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
	КэшированиеЗначений = (НЕ Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки,
	|	бит_ПоверкаСчетчиковСрезПоследних.Счетчик,
	|	бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку
	|ИЗ
	|	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_ПоверкаСчетчиковСрезПоследних
	|ГДЕ
	|	(НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если КэшированиеЗначений Тогда
			мКэшЗначений.ДатаПоверки = Выборка.ДатаПоверки;
		ИНаче
			Объект.ДатаПоверки = Выборка.ДатаПоверки;
		КонецЕсли; 
	Иначе
		Объект.ДатаПоверки = Дата("00010101000000");
	КонецЕсли;
	
	Если Индивидуальный Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПоказанияСчетчиковОстатки.Счетчик,
		|	бит_ПоказанияСчетчиковОстатки.Услуга,
		|	МАКСИМУМ(ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)) КАК НачальныеПоказания,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
		|				ТОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток
		|			ИНАЧЕ ВЫБОР
		|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|					ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|				КОНЕЦ
		|		КОНЕЦ) КАК КонечныеПоказания
		|ПОМЕСТИТЬ Показания
		|ИЗ
		|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
		|			&Дата,
		|			Объект = &Объект
		|				И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПоказанияСчетчиковОстатки.Счетчик,
		|	бит_ПоказанияСчетчиковОстатки.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
		|			&Дата,
		|			Объект = &Объект
		|				И Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Счетчики.Счетчик КАК Счетчик,
		|	Счетчики.Услуга,
		|	Счетчики.СпособРасчета КАК СпособРасчета,
		|	Счетчики.СпособРаспределения КАК СпособРаспределения,
		|	Показания.НачальныеПоказания КАК НачальныеПоказания,
		|	Показания.КонечныеПоказания КАК КонечныеПоказания,
		|	Счетчики.Многотарифный КАК Многотарифный,
		|	Счетчики.МестоУстановкиСчетчика КАК МестоУстановкиСчетчика,
		|	Счетчики.Приоритет КАК Приоритет
		|ИЗ
		|	Счетчики КАК Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ Показания КАК Показания
		|		ПО Счетчики.Счетчик = Показания.Счетчик
		|			И Счетчики.Услуга = Показания.Услуга
		|ИТОГИ
		|	МАКСИМУМ(СпособРасчета),
		|	МАКСИМУМ(СпособРаспределения),
		|	МАКСИМУМ(НачальныеПоказания),
		|	МАКСИМУМ(КонечныеПоказания),
		|	МАКСИМУМ(Многотарифный),
		|	МАКСИМУМ(МестоУстановкиСчетчика),
		|	МАКСИМУМ(Приоритет)
		|ПО
		|	Счетчик";
		
		ВыборкаСчетчики = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСчетчики.Следующий() Цикл
			
			Объект.СпособРасчета = ВыборкаСчетчики.СпособРасчета;
			Объект.Многотарифный = ВыборкаСчетчики.Многотарифный;
			
			Если НЕ ВыборкаСчетчики.Многотарифный Тогда
				Объект.НачальныеПоказания =  ВыборкаСчетчики.НачальныеПоказания;
				Объект.КонечныеПоказания  =  ВыборкаСчетчики.КонечныеПоказания;
			КонецЕсли;
			
			Объект.МестоУстановкиСчетчика = ВыборкаСчетчики.МестоУстановкиСчетчика;
			Объект.Приоритет              = ВыборкаСчетчики.МестоУстановкиСчетчика;
			
			Выборка = ВыборкаСчетчики.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если КэшированиеЗначений Тогда
					СписокУС.Добавить(Выборка.Услуга);
				Иначе
					НоваяСтрока = Объект.Услуги.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЦикла;
		
	Иначе
		
		//Условие = "";
		//Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика Тогда
		//
		//	Условие = "И Объект = &Объект";
		//
		//КонецЕсли; 
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПоказанияСчетчиковОстатки.Счетчик,
		|	бит_ПоказанияСчетчиковОстатки.Услуга,
		|	МАКСИМУМ(ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0)) КАК НачальныеПоказания,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток <> 0
		|				ТОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток
		|			ИНАЧЕ ВЫБОР
		|					КОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток <> 0
		|						ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
		|					ИНАЧЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
		|				КОНЕЦ
		|		КОНЕЦ) КАК КонечныеПоказания,
		|	бит_ПоказанияСчетчиковОстатки.Объект
		|ПОМЕСТИТЬ Показания
		|ИЗ
		|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПоказанияСчетчиковОстатки.Счетчик,
		|	бит_ПоказанияСчетчиковОстатки.Услуга,
		|	бит_ПоказанияСчетчиковОстатки.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ОтвЛица
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	ОтвЛица.ФизЛицо КАК ФизЛицо,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик КАК ГрупповойСчетчик,
		|	бит_ГрупповыеСчетчикиСрезПоследних.Услуга КАК Услуга,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание
		|ПОМЕСТИТЬ ЛицевыеСчета
		|ИЗ
		|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Дата, ГрупповойСчетчик = &Счетчик) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвЛица КАК ОтвЛица
		|		ПО бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет = ОтвЛица.ЛицевойСчет
		|ГДЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
		|	ОтвЛица.ФизЛицо,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик,
		|	бит_ГрупповыеСчетчикиСрезПоследних.Услуга,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьСтавкуПоСчетчику,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Поставщик,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СтатусКвартиры,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипКвартиры,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьПравилоУменьшения,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчетаУменьшения
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Счетчики.Счетчик КАК Счетчик,
		|	Счетчики.Услуга КАК Услуга,
		|	Счетчики.Объект КАК Объект,
		|	ЛицевыйСчета.ЛицевойСчет,
		|	ЛицевыйСчета.ФизЛицо КАК ОтветственноеЛицо,
		|	Счетчики.СпособРасчета КАК СпособРасчета,
		|	Счетчики.СпособРаспределения КАК СпособРаспределения,
		|	ЛицевыйСчета.ЛицевойСчет.Наименование КАК ЛицевойСчетНаименование,
		|	Показания.НачальныеПоказания КАК НачальныеПоказания,
		|	Показания.КонечныеПоказания КАК КонечныеПоказания,
		|	Счетчики.Многотарифный КАК Многотарифный,
		|	Счетчики.МестоУстановкиСчетчика КАК МестоУстановкиСчетчика,
		|	Счетчики.Приоритет КАК Приоритет,
		|	Счетчики.ИспользоватьСтавкуПоСчетчику КАК ИспользоватьСтавкуПоСчетчику,
		|	Счетчики.Поставщик КАК Поставщик,
		|	Счетчики.СтатусКвартиры КАК СтатусКвартиры,
		|	Счетчики.ТипКвартиры КАК ТипКвартиры,
		|	Счетчики.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
		|	Счетчики.ОсновнаяУслуга КАК ОсновнаяУслуга,
		|	Счетчики.ИспользоватьПравилоУменьшения КАК ИспользоватьПравилоУменьшения,
		|	Счетчики.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения
		|ИЗ
		|	Счетчики КАК Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЛицевыеСчета КАК ЛицевыйСчета
		|		ПО Счетчики.Счетчик = ЛицевыйСчета.ГрупповойСчетчик
		|			И Счетчики.Услуга = ЛицевыйСчета.Услуга
		|			И Счетчики.Объект = ЛицевыйСчета.Здание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Показания КАК Показания
		|		ПО Счетчики.Услуга = Показания.Услуга
		|			И Счетчики.Счетчик = Показания.Счетчик
		|			И Счетчики.Объект = Показания.Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчетНаименование
		|ИТОГИ
		|	МАКСИМУМ(СпособРасчета),
		|	МАКСИМУМ(СпособРаспределения),
		|	МАКСИМУМ(НачальныеПоказания),
		|	МАКСИМУМ(КонечныеПоказания),
		|	МАКСИМУМ(Многотарифный),
		|	МАКСИМУМ(МестоУстановкиСчетчика),
		|	МАКСИМУМ(Приоритет),
		|	МАКСИМУМ(ИспользоватьСтавкуПоСчетчику),
		|	МАКСИМУМ(Поставщик),
		|	МАКСИМУМ(СтатусКвартиры),
		|	МАКСИМУМ(ТипКвартиры),
		|	МАКСИМУМ(СчетчикСЗависимымиУслугами),
		|	МАКСИМУМ(ОсновнаяУслуга),
		|	МАКСИМУМ(ИспользоватьПравилоУменьшения),
		|	МАКСИМУМ(СпособРасчетаУменьшения)
		|ПО
		|	Счетчик,
		|	Услуга,
		|	Объект";
		
		Результат = Запрос.Выполнить();
		ВыборкаСчетчики = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСчетчики.Следующий() Цикл
			
			Объект.СпособРасчета = ВыборкаСчетчики.СпособРасчета;
			Объект.Многотарифный = ВыборкаСчетчики.Многотарифный;
			
			Если НЕ ВыборкаСчетчики.Многотарифный Тогда
				// БИТ_ЖКХ 22.01.2015{{
				Если НЕ ВыборкаСчетчики.НачальныеПоказания = Null Тогда
					Объект.НачальныеПоказания =  ВыборкаСчетчики.НачальныеПоказания;
				КонецЕсли;
				Если НЕ ВыборкаСчетчики.КонечныеПоказания = Null Тогда
					Объект.КонечныеПоказания  =  ВыборкаСчетчики.КонечныеПоказания;
				КонецЕсли;
				// БИТ_ЖКХ 22.01.2015}}
			КонецЕсли;
			
			Если КэшированиеЗначений Тогда
				
				мКэшЗначений.МестоУстановкиСчетчика = ВыборкаСчетчики.МестоУстановкиСчетчика;
				мКэшЗначений.Приоритет              = ВыборкаСчетчики.Приоритет;
				
				мКэшЗначений.ИспользоватьСтавкуПоСчетчику = ВыборкаСчетчики.ИспользоватьСтавкуПоСчетчику;
				мКэшЗначений.СчетчикСЗависимымиУслугами   = ВыборкаСчетчики.СчетчикСЗависимымиУслугами;
				
				мКэшЗначений.ИспользоватьПравилоУменьшения = ВыборкаСчетчики.ИспользоватьПравилоУменьшения;
				
			Иначе
				
				мКэшЗначений.МестоУстановкиСчетчика = ВыборкаСчетчики.МестоУстановкиСчетчика;
				мКэшЗначений.Приоритет              = ВыборкаСчетчики.Приоритет;
				
				мКэшЗначений.ИспользоватьСтавкуПоСчетчику = ВыборкаСчетчики.ИспользоватьСтавкуПоСчетчику;
				мКэшЗначений.СчетчикСЗависимымиУслугами   = ВыборкаСчетчики.СчетчикСЗависимымиУслугами;
				
				мКэшЗначений.ИспользоватьПравилоУменьшения = ВыборкаСчетчики.ИспользоватьПравилоУменьшения;
				
			КонецЕсли; 
			
			ВыборкаУслуга = ВыборкаСчетчики.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаУслуга.Следующий() Цикл
				
				Если КэшированиеЗначений Тогда
					НоваяСтрока = мКэшЗначений.ТаблицаУслуг.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаУслуга);
					СписокУС.Добавить(ВыборкаУслуга.Услуга);
				Иначе
					НоваяСтрока = Объект.Услуги.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаУслуга);
				КонецЕсли;
				
				ВыборкаОбъект = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаОбъект.Следующий() Цикл
					
					СписокЗданий.Добавить(ВыборкаОбъект.Объект, Строка(ВыборкаОбъект.Объект.Улица) + ", " + Строка(ВыборкаОбъект.Объект));
					
					Выборка = ВыборкаОбъект.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						Если КэшированиеЗначений Тогда
							Если СписокЛС.НайтиПоЗначению(Выборка.ЛицевойСчет) = Неопределено Тогда
								СписокЛС.Добавить(Выборка.ЛицевойСчет);
							КонецЕсли; 
						Иначе
							НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
							НоваяСтрока.Адрес  = Строка(НоваяСтрока.ЛицевойСчет.УлицаЛицевогоСчета) + ", " + Строка(НоваяСтрока.ЛицевойСчет.Здание);
							НоваяСтрока.Здание = НоваяСтрока.ЛицевойСчет.Здание;
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЦикла; 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	мКэшЗначений.СписокЛС     = СписокЛС;
	мКэшЗначений.СписокУС     = СписокУС;
	мКэшЗначений.СписокЗданий = СписокЗданий;
	
	Возврат мКэшЗначений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
